Script started on Sun Feb  9 18:38:36 2014
[?1034hbash-1$ valgrind malloc
==23472== Memcheck, a memory error detector
==23472== Copyright (C) 2002-2012, and GNU GPL'd, by Julian Seward et al.
==23472== Using Valgrind-3.8.1 and LibVEX; rerun with -h for copyright info
==23472== Command: malloc
==23472== 
0x4c28090-> {6, (nil)}
==23472== 
==23472== HEAP SUMMARY:
==23472==     in use at exit: 16 bytes in 1 blocks
==23472==   total heap usage: 2 allocs, 1 frees, 32 bytes allocated
==23472== 
==23472== LEAK SUMMARY:
==23472==    definitely lost: 16 bytes in 1 blocks
==23472==    indirectly lost: 0 bytes in 0 blocks
==23472==      possibly lost: 0 bytes in 0 blocks
==23472==    still reachable: 0 bytes in 0 blocks
==23472==         suppressed: 0 bytes in 0 blocks
==23472== Rerun with --leak-check=full to see details of leaked memory
==23472== 
==23472== For counts of detected and suppressed errors, rerun with: -v
==23472== ERROR SUMMARY: 0 errors from 0 contexts (suppressed: 6 from 6)
bash-2$ gdb malloc
[?1034hGNU gdb (GDB) Red Hat Enterprise Linux (7.6-34.el6)
Copyright (C) 2013 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-redhat-linux-gnu".
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>...
Reading symbols from /afs/cats.ucsc.edu/users/k/androbbi/private/cmps012m/lab5/malloc...done.
(gdb) break main
Breakpoint 1 at 0x400594: file malloc.c, line 13.
(gdb) run
Starting program: /afs/cats.ucsc.edu/users/k/androbbi/private/cmps012m/lab5/malloc 
warning: the debug information found in "/usr/lib/debug//lib64/ld-2.12.so.debug" does not match "/lib64/ld-linux-x86-64.so.2" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug/lib64/ld-2.12.so.debug" does not match "/lib64/ld-linux-x86-64.so.2" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug//lib64/libm-2.12.so.debug" does not match "/lib64/libm.so.6" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug/lib64/libm-2.12.so.debug" does not match "/lib64/libm.so.6" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug//lib64/libc-2.12.so.debug" does not match "/lib64/libc.so.6" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug/lib64/libc-2.12.so.debug" does not match "/lib64/libc.so.6" (CRC mismatch).


Breakpoint 1, main (argc=1, argv=0x7fffffffdf78) at malloc.c:13
13	   node *ptr = malloc (sizeof (struct node));
Missing separate debuginfos, use: debuginfo-install glibc-2.12-1.107.el6_4.5.x86_64
(gdb) print ptr
$1 = (node *) 0x4004a0 <_start>
(gdb) print ptrt [1@*
$2 = {value = -1991643855, link = 0x495450f0e48348e2}
(gdb) next
14	   ptr = malloc (sizeof (node));
(gdb) nextprint *ptr(gdb) [6Pnextprint *ptr[1Pptr
$3 = (node *) 0x601010
(gdb) print ptr(gdb) [5Pnextprint ptr(gdb) [Kprint ptr(gdb) [5Pnextprint *ptr[1Pptr[1@*ptr
$4 = {value = 0, link = 0x0}
(gdb) next
15	   ptr->value = 6;
(gdb) next
16	   ptr->link = NULL;
(gdb) next
17	   printf ("%p-> {%d, %p}\n", ptr, ptr->value, ptr->link);
(gdb) print ptr
$5 = (node *) 0x601030
(gdb) print *ptr
$6 = {value = 6, link = 0x0}
(gdb) next
0x601030-> {6, (nil)}
18	   free (ptr);
(gdb) next
19	   return EXIT_SUCCESS;
(gdb) next
20	}
(gdb) next
0x000000375361ecdd in __libc_start_main () from /lib64/libc.so.6
(gdb) quit
A debugging session is active.

	Inferior 1 [process 23517] will be killed.

Quit anyway? (y or n) yes
bash-3$ exit
exit

Script done on Sun Feb  9 18:40:29 2014
