Script started on Wed Feb 19 23:56:47 2014
[?1034hbash-1$ gdb list2
[?1034hGNU gdb (GDB) Red Hat Enterprise Linux (7.6-34.el6)
Copyright (C) 2013 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-redhat-linux-gnu".
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>...
Reading symbols from /afs/cats.ucsc.edu/users/k/androbbi/private/cmps012m/lab5/list2...done.
(gdb) break main
Breakpoint 1 at 0x4005bf: file list2.c, line 15.
(gdb) run foo bar baz
Starting program: /afs/cats.ucsc.edu/users/k/androbbi/private/cmps012m/lab5/list2 foo bar baz
warning: Skipping deprecated .gdb_index section in /usr/lib/debug/lib64/ld-2.12.so.debug.
Do "set use-deprecated-index-sections on" before the file is read
to use the section anyway.

Breakpoint 1, main (argc=4, argv=0x7fffffffdf48) at list2.c:15
15	   for (int argi = 0; argi < 5; ++argi) {
(gdb) print argc
$1 = 4
(gdb) print argv
$2 = (char **) 0x7fffffffdf48
(gdb) print argv[0]
$3 = 0x7fffffffe267 "/afs/cats.ucsc.edu/users/k/androbbi/private/cmps012m/lab5/list2"
(gdb) print argv[0][1P]1]
$4 = 0x7fffffffe2a7 "foo"
(gdb) print argv[1][1P]2]
$5 = 0x7fffffffe2ab "bar"
(gdb) print argv[2][1P]3]
$6 = 0x7fffffffe2af "baz"
(gdb) print argv[3][1P]4]
$7 = 0x0
(gdb) print argv[4][1P]5]
$8 = 0x7fffffffe2b3 "MANWIDTH=72"
(gdb) print argv[5]][1P]6]
$9 = 0x7fffffffe2bf "MANPATH=/opt/rh/devtoolset-2/root/usr/share/man:"
(gdb) exit
Undefined command: "exit".  Try "help".
(gdb) quit
A debugging session is active.

	Inferior 1 [process 17359] will be killed.

Quit anyway? (y or n) yes
bash-2$ exit
exit

Script done on Wed Feb 19 23:58:32 2014
